window.cardCategories = {
				basic: ["杀", "闪", "桃", "酒", "火杀", "雷杀"],
				trick: ["决斗", "无中生有", "过河拆桥", "顺手牵羊", "借刀杀人", "南蛮入侵", "万箭齐发", "桃园结义", "五谷丰登", "无懈可击", "火攻", "铁索连环", ],
				ystrick: ["乐不思蜀", "闪电", "兵粮寸断"],
				weapon: ["诸葛连弩", "雌雄双股剑", "青龙偃月刀", "青釭剑", "丈八蛇矛", "麒麟弓", "贯石斧", "方天画戟", "寒冰剑", "古锭刀", "朱雀羽扇"],
				armor: ["八卦阵", "仁王盾", "藤甲", "白银狮子"],
				horse: ["赤兔", "大宛", "紫骍", "的卢", "绝影", "爪黄飞电", "骅骝"]
			};
			window.standardDeck = [{
					name: "杀",
					suits: ["♠️7","♥️J", "♣️2", "♣️3", "♣️4", "♣️5", "♣️6", "♣️7","♦️6", "♦️7", "♦️8", "♦️9", "♦️10", "♦️K"],
					count: 1
				},
				{
					name: "杀",
					suits: ["♠️8", "♠️9", "♠️10", "♥️10","♣️8", "♣️9", "♣️10", "♣️J"],
					count: 2
				},
				{
					name: "火杀",
					suits: ["♥️4", "♥️7", "♥️10", "♦️4", "♦️5"],
					count: 1
				},
				{
					name: "雷杀",
					suits: ["♠️4", "♠️5", "♠️6", "♠️7", "♠️8", "♣️5", "♣️6", "♣️7", "♣️8"],
					count: 1
				},
				{
					"name": "闪",
					"suits": ["♥️2","♦️2","♦️6", "♦️7", "♦️8", "♦️10"],
					"count": 2
				},
				{
					"name": "闪",
					"suits": ["♥️8", "♥️9", "♥️J", "♥️Q","♥️K","♦️3", "♦️4", "♦️5", "♦️9"],
					"count": 1
				},
				{
					"name": "闪",
					"suits": ["♦️J"],
					"count": 3
				},
				{
					name: "桃",
					suits: ["♥️3", "♥️4", "♥️5", "♥️7", "♥️8", "♥️9", "♥️Q","♦️2", "♦️3", "♦️Q"],
					count: 1
				},
				{
					name: "桃",
					suits: ["♥️6"],
					count: 2
				},
				{
					name: "酒",
					suits: ["♠️3", "♠️9", "♣️3", "♣️9", "♦️9"],
					count: 1
				},
				{
					name: "决斗",
					suits: ["♠️A", "♣️A", "♦️A"],
					count: 1
				},
				{
					name: "无中生有",
					suits: ["♥️7", "♥️8", "♥️9", "♥️J"],
					count: 1
				},
				{
					name: "过河拆桥",
					suits: ["♠️3", "♠️4", "♠️Q", "♥️Q", "♣️3", "♣️4"],
					count: 1
				},
				{
					name: "顺手牵羊",
					suits: ["♠️3", "♠️4", "♠️J", "♦️3", "♦️4"],
					count: 1
				},
				{
					name: "借刀杀人",
					suits: ["♣️Q", "♣️K"],
					count: 1
				},
				{
					name: "南蛮入侵",
					suits: ["♠️7", "♠️K", "♣️7"],
					count: 1
				},
				{
					name: "万箭齐发",
					suits: ["♥️A"],
					count: 1
				},
				{
					name: "桃园结义",
					suits: ["♥️A"],
					count: 1
				},
				{
					name: "五谷丰登",
					suits: ["♥️3", "♥️4"],
					count: 1
				},
				{
					name: "无懈可击",
					suits: ["♠️J", "♣️Q", "♣️K", "♦️Q", "♠️K", "♥️A", "♥️K"],
					count: 1
				},
				{
					name: "火攻",
					suits: ["♥️2", "♥️3", "♦️Q"],
					count: 1
				},
				{
					name: "铁索连环",
					suits: ["♠️J", "♠️Q", "♣️10", "♣️J", "♣️Q", "♣️K"],
					count: 1
				},
				{
					name: "乐不思蜀",
					suits: ["♠️6", "♥️6", "♣️6"],
					count: 1
				},
				{
					name: "闪电",
					suits: ["♠️A", "♥️Q"],
					count: 1
				},
				{
					name: "兵粮寸断",
					suits: ["♠️10", "♣️4"],
					count: 1
				},
				{
					name: "雌雄双股剑",
					suits: ["♠️2"],
					count: 1
				},
				{
					name: "青龙偃月刀",
					suits: ["♠️5"],
					count: 1
				},
				{
					name: "青釭剑",
					suits: ["♠️6"],
					count: 1
				},
				{
					name: "丈八蛇矛",
					suits: ["♠️Q"],
					count: 1
				},
				{
					name: "麒麟弓",
					suits: ["♥️5"],
					count: 1
				},
				{
					name: "诸葛连弩",
					suits: ["♣️A", "♦️A"],
					count: 1
				},
				{
					name: "贯石斧",
					suits: ["♦️5"],
					count: 1
				},
				{
					name: "方天画戟",
					suits: ["♦️Q"],
					count: 1
				},
				{
					name: "寒冰剑",
					suits: ["♠️2"],
					count: 1
				},
				{
					name: "古锭刀",
					suits: ["♠️A"],
					count: 1
				},
				{
					name: "朱雀羽扇",
					suits: ["♦️A"],
					count: 1
				},
				{
					name: "八卦阵",
					suits: ["♠️2", "♣️2"],
					count: 1
				},
				{
					name: "仁王盾",
					suits: ["♣️2"],
					count: 1
				},
				{
					name: "藤甲",
					suits: ["♠️2", "♣️2"],
					count: 1
				},
				{
					name: "白银狮子",
					suits: ["♣️A"],
					count: 1
				},
				{
					name: "赤兔",
					suits: ["♥️5"],
					count: 1
				},
				{
					name: "大宛",
					suits: ["♠️K"],
					count: 1
				},
				{
					name: "紫骍",
					suits: ["♦️K"],
					count: 1
				},
				{
					name: "的卢",
					suits: ["♣️5"],
					count: 1
				},
				{
					name: "绝影",
					suits: ["♠️5"],
					count: 1
				},
				{
					name: "爪黄飞电",
					suits: ["♥️K"],
					count: 1
				},
				{
					name: "骅骝",
					suits: ["♦️K"],
					count: 1
				},
			];
